package seminar5Homework;

public class Main {
    public static void main(String[] args) {
        //System.out.println(InfixToPostfix.infixToPostfix("3 - 2"));
        InfixToPostfixx.infixToPostfix("3 - 2");
    }
}
// Реализовать алгоритм перевода из инфиксной записи
// в постфиксную для арифметического выражения.
